# Pandas Library

## کتابخانه پانداس

In [1]:
import pandas as pd
import numpy as np

### 1. سری ها

In [5]:
x0 = [5,3,8,7]
s1 = pd.Series(x0)
s1

0    5
1    3
2    8
3    7
dtype: int64

In [6]:
s1.values

array([5, 3, 8, 7], dtype=int64)

In [7]:
s2 = pd.Series(x0,index=['a','b','c','d'])
s2

a    5
b    3
c    8
d    7
dtype: int64

In [8]:
s2['b']

3

In [9]:
s2[1]

3

In [10]:
s2[['a','d']]

a    5
d    7
dtype: int64

In [11]:
np.sqrt(s2)

a    2.236068
b    1.732051
c    2.828427
d    2.645751
dtype: float64

In [12]:
s2

a    5
b    3
c    8
d    7
dtype: int64

In [13]:
'a' in s2

True

In [14]:
'f' in s2

False

In [15]:
8 in s2

False

In [2]:
# ساخت سری از یک دیکشنری

data = {'Bushehr':25000,'Borazjan':12000,'Kangan':1500}
s3 = pd.Series(data)
s3

Bushehr     25000
Borazjan    12000
Kangan       1500
dtype: int64

In [9]:
city = ['Kangan','Bushehr','Borazjan']
s4 = pd.Series(data,index=city)
s4

Kangan       1500.0
Bushehr     25000.0
Borazjan    12000.0
dtype: float64

In [8]:
city = ['Kangan','Bushehr','Borazjan','Khormoj']
s5 = pd.Series(data,index=city)
s5

Kangan       1500.0
Bushehr     25000.0
Borazjan    12000.0
Khormoj         NaN
dtype: float64

In [10]:
s5.isnull()

Kangan      False
Bushehr     False
Borazjan    False
Khormoj      True
dtype: bool

In [11]:
pd.isnull(s5)

Kangan      False
Bushehr     False
Borazjan    False
Khormoj      True
dtype: bool

In [12]:
pd.Series(5,index=range(7))

0    5
1    5
2    5
3    5
4    5
5    5
6    5
dtype: int64

## DataFrame

In [13]:
data = {'Name':['Ahmad','Zahra','Ali'],
        'Amar':[20,18,19],
        'Computer':[18,19,17]}      
data

{'Name': ['Ahmad', 'Zahra', 'Ali'],
 'Amar': [20, 18, 19],
 'Computer': [18, 19, 17]}

In [14]:
f1 = pd.DataFrame(data)
f1

    Name  Amar  Computer
0  Ahmad    20        18
1  Zahra    18        19
2    Ali    19        17

In [18]:
f2 = pd.DataFrame(data,columns=['Name','Amar','Riazi'])
f2

    Name  Amar Riazi
0  Ahmad    20   NaN
1  Zahra    18   NaN
2    Ali    19   NaN

In [19]:
f1['Computer']

0    18
1    19
2    17
Name: Computer, dtype: int64

In [20]:
f1.Computer

0    18
1    19
2    17
Name: Computer, dtype: int64

In [24]:
D = {'Vorudi':[97,97,97,98,98,98],
    'Vajeh':[18,17,16,15,16,17],
    'B1':[18,19,17,19,18,17]}
f2 = pd.DataFrame(D,index=[9712,9710,9718,9817,9816,9815])
f2

      Vorudi  Vajeh  B1
9712      97     18  18
9710      97     17  19
9718      97     16  17
9817      98     15  19
9816      98     16  18
9815      98     17  17

In [25]:
f2.B1

9712    18
9710    19
9718    17
9817    19
9816    18
9815    17
Name: B1, dtype: int64

In [27]:
f2.loc[9718]

Vorudi    97
Vajeh     16
B1        17
Name: 9718, dtype: int64

In [30]:
f2[0:2]

      Vorudi  Vajeh  B1
9712      97     18  18
9710      97     17  19

In [33]:
f2['B1']

9712    18
9710    19
9718    17
9817    19
9816    18
9815    17
Name: B1, dtype: int64

In [32]:
f2.iloc[0:2,0:2]

      Vorudi  Vajeh
9712      97     18
9710      97     17